node {
  name: "image_tensor"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: -1
        }
        dim {
          size: -1
        }
        dim {
          size: 3
        }
      }
    }
  }
}
node {
  name: "Preprocessor/mul"
  op: "Mul"
  input: "image_tensor"
  input: "Preprocessor/mul/x"
}
node {
  name: "Preprocessor/sub"
  op: "Sub"
  input: "Preprocessor/mul"
  input: "Preprocessor/sub/y"
}
node {
  name: "FirstStageFeatureExtractor/conv0/Conv2D"
  op: "Conv2D"
  input: "Preprocessor/sub"
  input: "FirstStageFeatureExtractor/conv0/weights/read/_112__cf__118"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "FirstStageFeatureExtractor/conv0_bn/FusedBatchNorm"
  op: "BiasAdd"
  input: "FirstStageFeatureExtractor/conv0/Conv2D"
  input: "FirstStageFeatureExtractor/conv0/Conv2D_bn_offset"
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_1/Relu"
  op: "Relu"
  input: "FirstStageFeatureExtractor/conv0_bn/FusedBatchNorm"
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_1/Pad"
  op: "Pad"
  input: "FirstStageFeatureExtractor/cell_stem_1/Relu"
  input: "FirstStageFeatureExtractor/cell_stem_1/Pad/paddings"
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_1/strided_slice"
  op: "StridedSlice"
  input: "FirstStageFeatureExtractor/cell_stem_1/Pad"
  input: "FirstStageFeatureExtractor/cell_stem_1/strided_slice/stack"
  input: "FirstStageFeatureExtractor/cell_stem_1/strided_slice/stack_1"
  input: "FirstStageFeatureExtractor/cell_stem_1/strided_slice/stack_2"
  attr {
    key: "begin_mask"
    value {
      i: 9
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 15
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_1/AvgPool_1"
  op: "AvgPool"
  input: "FirstStageFeatureExtractor/cell_stem_1/strided_slice"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "ksize"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_1/path2_conv/Conv2D"
  op: "Conv2D"
  input: "FirstStageFeatureExtractor/cell_stem_1/AvgPool_1"
  input: "FirstStageFeatureExtractor/cell_stem_1/path2_conv/weights/read/_201__cf__207"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_1/concat_bn_in1"
  op: "BiasAdd"
  input: "FirstStageFeatureExtractor/cell_stem_1/path2_conv/Conv2D"
  input: "FirstStageFeatureExtractor/cell_stem_1/path2_conv/Conv2D_bn_offset"
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_1/AvgPool"
  op: "AvgPool"
  input: "FirstStageFeatureExtractor/cell_stem_1/Relu"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "ksize"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_1/path1_conv/Conv2D"
  op: "Conv2D"
  input: "FirstStageFeatureExtractor/cell_stem_1/AvgPool"
  input: "FirstStageFeatureExtractor/cell_stem_1/path1_conv/weights/read/_202__cf__208"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_1/concat_bn_in0"
  op: "BiasAdd"
  input: "FirstStageFeatureExtractor/cell_stem_1/path1_conv/Conv2D"
  input: "FirstStageFeatureExtractor/cell_stem_1/path1_conv/Conv2D_bn_offset"
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_1/final_path_bn/FusedBatchNorm"
  op: "ConcatV2"
  input: "FirstStageFeatureExtractor/cell_stem_1/concat_bn_in0"
  input: "FirstStageFeatureExtractor/cell_stem_1/concat_bn_in1"
  input: "FirstStageFeatureExtractor/cell_stem_1/concat/axis"
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_2/right/Relu"
  op: "Relu"
  input: "FirstStageFeatureExtractor/cell_stem_1/final_path_bn/FusedBatchNorm"
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_2/right/separable_5x5_1/separable_conv2d/depthwise"
  op: "DepthwiseConv2dNative"
  input: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_2/right/Relu"
  input: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_2/right/separable_5x5_1/depthwise_weights/read/_238__cf__244"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_2/right/separable_5x5_1/separable_conv2d"
  op: "Conv2D"
  input: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_2/right/separable_5x5_1/separable_conv2d/depthwise"
  input: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_2/right/separable_5x5_1/pointwise_weights/read/_237__cf__243"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_2/right/bn_sep_5x5_1/FusedBatchNorm"
  op: "BiasAdd"
  input: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_2/right/separable_5x5_1/separable_conv2d"
  input: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_2/right/separable_5x5_1/separable_conv2d_bn_offset"
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_2/right/Relu_1"
  op: "Relu"
  input: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_2/right/bn_sep_5x5_1/FusedBatchNorm"
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_2/right/separable_5x5_2/separable_conv2d/depthwise"
  op: "DepthwiseConv2dNative"
  input: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_2/right/Relu_1"
  input: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_2/right/separable_5x5_2/depthwise_weights/read/_232__cf__238"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_2/right/separable_5x5_2/separable_conv2d"
  op: "Conv2D"
  input: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_2/right/separable_5x5_2/separable_conv2d/depthwise"
  input: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_2/right/separable_5x5_2/pointwise_weights/read/_231__cf__237"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_2/right/bn_sep_5x5_2/FusedBatchNorm"
  op: "BiasAdd"
  input: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_2/right/separable_5x5_2/separable_conv2d"
  input: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_2/right/separable_5x5_2/separable_conv2d_bn_offset"
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_1/right/Relu"
  op: "Relu"
  input: "FirstStageFeatureExtractor/cell_stem_1/final_path_bn/FusedBatchNorm"
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_1/right/separable_7x7_1/separable_conv2d/depthwise"
  op: "DepthwiseConv2dNative"
  input: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_1/right/Relu"
  input: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_1/right/separable_7x7_1/depthwise_weights/read/_226__cf__232"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_1/right/separable_7x7_1/separable_conv2d"
  op: "Conv2D"
  input: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_1/right/separable_7x7_1/separable_conv2d/depthwise"
  input: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_1/right/separable_7x7_1/pointwise_weights/read/_225__cf__231"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_1/right/bn_sep_7x7_1/FusedBatchNorm"
  op: "BiasAdd"
  input: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_1/right/separable_7x7_1/separable_conv2d"
  input: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_1/right/separable_7x7_1/separable_conv2d_bn_offset"
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_1/right/Relu_1"
  op: "Relu"
  input: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_1/right/bn_sep_7x7_1/FusedBatchNorm"
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_1/right/separable_7x7_2/separable_conv2d/depthwise"
  op: "DepthwiseConv2dNative"
  input: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_1/right/Relu_1"
  input: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_1/right/separable_7x7_2/depthwise_weights/read/_220__cf__226"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_1/right/separable_7x7_2/separable_conv2d"
  op: "Conv2D"
  input: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_1/right/separable_7x7_2/separable_conv2d/depthwise"
  input: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_1/right/separable_7x7_2/pointwise_weights/read/_219__cf__225"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_1/right/bn_sep_7x7_2/FusedBatchNorm"
  op: "BiasAdd"
  input: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_1/right/separable_7x7_2/separable_conv2d"
  input: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_1/right/separable_7x7_2/separable_conv2d_bn_offset"
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_0/right/Relu"
  op: "Relu"
  input: "FirstStageFeatureExtractor/cell_stem_1/final_path_bn/FusedBatchNorm"
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_0/right/separable_7x7_1/separable_conv2d/depthwise"
  op: "DepthwiseConv2dNative"
  input: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_0/right/Relu"
  input: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_0/right/separable_7x7_1/depthwise_weights/read/_196__cf__202"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_0/right/separable_7x7_1/separable_conv2d"
  op: "Conv2D"
  input: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_0/right/separable_7x7_1/separable_conv2d/depthwise"
  input: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_0/right/separable_7x7_1/pointwise_weights/read/_195__cf__201"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_0/right/bn_sep_7x7_1/FusedBatchNorm"
  op: "BiasAdd"
  input: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_0/right/separable_7x7_1/separable_conv2d"
  input: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_0/right/separable_7x7_1/separable_conv2d_bn_offset"
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_0/right/Relu_1"
  op: "Relu"
  input: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_0/right/bn_sep_7x7_1/FusedBatchNorm"
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_0/right/separable_7x7_2/separable_conv2d/depthwise"
  op: "DepthwiseConv2dNative"
  input: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_0/right/Relu_1"
  input: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_0/right/separable_7x7_2/depthwise_weights/read/_190__cf__196"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_0/right/separable_7x7_2/separable_conv2d"
  op: "Conv2D"
  input: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_0/right/separable_7x7_2/separable_conv2d/depthwise"
  input: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_0/right/separable_7x7_2/pointwise_weights/read/_189__cf__195"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_0/right/bn_sep_7x7_2/FusedBatchNorm"
  op: "BiasAdd"
  input: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_0/right/separable_7x7_2/separable_conv2d"
  input: "FirstStageFeatureExtractor/cell_stem_1/comb_iter_0/right/separable_7x7_2/separable_conv2d_bn_offset"
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_2/right/Relu"
  op: "Relu"
  input: "FirstStageFeatureExtractor/conv0_bn/FusedBatchNorm"
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_2/right/separable_5x5_1/separable_conv2d/depthwise"
  op: "DepthwiseConv2dNative"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_2/right/Relu"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_2/right/separable_5x5_1/depthwise_weights/read/_172__cf__178"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_2/right/separable_5x5_1/separable_conv2d"
  op: "Conv2D"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_2/right/separable_5x5_1/separable_conv2d/depthwise"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_2/right/separable_5x5_1/pointwise_weights/read/_171__cf__177"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_2/right/bn_sep_5x5_1/FusedBatchNorm"
  op: "BiasAdd"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_2/right/separable_5x5_1/separable_conv2d"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_2/right/separable_5x5_1/separable_conv2d_bn_offset"
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_2/right/Relu_1"
  op: "Relu"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_2/right/bn_sep_5x5_1/FusedBatchNorm"
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_2/right/separable_5x5_2/separable_conv2d/depthwise"
  op: "DepthwiseConv2dNative"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_2/right/Relu_1"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_2/right/separable_5x5_2/depthwise_weights/read/_166__cf__172"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_2/right/separable_5x5_2/separable_conv2d"
  op: "Conv2D"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_2/right/separable_5x5_2/separable_conv2d/depthwise"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_2/right/separable_5x5_2/pointwise_weights/read/_165__cf__171"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_2/right/bn_sep_5x5_2/FusedBatchNorm"
  op: "BiasAdd"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_2/right/separable_5x5_2/separable_conv2d"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_2/right/separable_5x5_2/separable_conv2d_bn_offset"
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_1/right/Relu"
  op: "Relu"
  input: "FirstStageFeatureExtractor/conv0_bn/FusedBatchNorm"
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_1/right/separable_7x7_1/separable_conv2d/depthwise"
  op: "DepthwiseConv2dNative"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_1/right/Relu"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_1/right/separable_7x7_1/depthwise_weights/read/_160__cf__166"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_1/right/separable_7x7_1/separable_conv2d"
  op: "Conv2D"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_1/right/separable_7x7_1/separable_conv2d/depthwise"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_1/right/separable_7x7_1/pointwise_weights/read/_159__cf__165"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_1/right/bn_sep_7x7_1/FusedBatchNorm"
  op: "BiasAdd"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_1/right/separable_7x7_1/separable_conv2d"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_1/right/separable_7x7_1/separable_conv2d_bn_offset"
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_1/right/Relu_1"
  op: "Relu"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_1/right/bn_sep_7x7_1/FusedBatchNorm"
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_1/right/separable_7x7_2/separable_conv2d/depthwise"
  op: "DepthwiseConv2dNative"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_1/right/Relu_1"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_1/right/separable_7x7_2/depthwise_weights/read/_154__cf__160"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_1/right/separable_7x7_2/separable_conv2d"
  op: "Conv2D"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_1/right/separable_7x7_2/separable_conv2d/depthwise"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_1/right/separable_7x7_2/pointwise_weights/read/_153__cf__159"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_1/right/bn_sep_7x7_2/FusedBatchNorm"
  op: "BiasAdd"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_1/right/separable_7x7_2/separable_conv2d"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_1/right/separable_7x7_2/separable_conv2d_bn_offset"
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/right/Relu"
  op: "Relu"
  input: "FirstStageFeatureExtractor/conv0_bn/FusedBatchNorm"
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/right/separable_7x7_1/separable_conv2d/depthwise"
  op: "DepthwiseConv2dNative"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/right/Relu"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/right/separable_7x7_1/depthwise_weights/read/_136__cf__142"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/right/separable_7x7_1/separable_conv2d"
  op: "Conv2D"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/right/separable_7x7_1/separable_conv2d/depthwise"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/right/separable_7x7_1/pointwise_weights/read/_135__cf__141"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/right/bn_sep_7x7_1/FusedBatchNorm"
  op: "BiasAdd"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/right/separable_7x7_1/separable_conv2d"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/right/separable_7x7_1/separable_conv2d_bn_offset"
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/right/Relu_1"
  op: "Relu"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/right/bn_sep_7x7_1/FusedBatchNorm"
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/right/separable_7x7_2/separable_conv2d/depthwise"
  op: "DepthwiseConv2dNative"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/right/Relu_1"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/right/separable_7x7_2/depthwise_weights/read/_130__cf__136"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/right/separable_7x7_2/separable_conv2d"
  op: "Conv2D"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/right/separable_7x7_2/separable_conv2d/depthwise"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/right/separable_7x7_2/pointwise_weights/read/_129__cf__135"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/right/bn_sep_7x7_2/FusedBatchNorm"
  op: "BiasAdd"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/right/separable_7x7_2/separable_conv2d"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/right/separable_7x7_2/separable_conv2d_bn_offset"
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_0/Relu"
  op: "Relu"
  input: "FirstStageFeatureExtractor/conv0_bn/FusedBatchNorm"
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_0/1x1/Conv2D"
  op: "Conv2D"
  input: "FirstStageFeatureExtractor/cell_stem_0/Relu"
  input: "FirstStageFeatureExtractor/cell_stem_0/1x1/weights/read/_107__cf__113"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_0/beginning_bn/FusedBatchNorm"
  op: "BiasAdd"
  input: "FirstStageFeatureExtractor/cell_stem_0/1x1/Conv2D"
  input: "FirstStageFeatureExtractor/cell_stem_0/1x1/Conv2D_bn_offset"
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_0/split"
  op: "Split"
  input: "FirstStageFeatureExtractor/cell_stem_0/split/split_dim"
  input: "FirstStageFeatureExtractor/cell_stem_0/beginning_bn/FusedBatchNorm"
  attr {
    key: "num_split"
    value {
      i: 1
    }
  }
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_4/right/MaxPool2D/MaxPool"
  op: "MaxPool"
  input: "FirstStageFeatureExtractor/cell_stem_0/split"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "ksize"
    value {
      list {
        i: 1
        i: 3
        i: 3
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_2/left/AvgPool2D/AvgPool"
  op: "AvgPool"
  input: "FirstStageFeatureExtractor/cell_stem_0/split"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "ksize"
    value {
      list {
        i: 1
        i: 3
        i: 3
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_2/combine/add"
  op: "Add"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_2/left/AvgPool2D/AvgPool"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_2/right/bn_sep_5x5_2/FusedBatchNorm"
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_1/left/MaxPool2D/MaxPool"
  op: "MaxPool"
  input: "FirstStageFeatureExtractor/cell_stem_0/split"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "ksize"
    value {
      list {
        i: 1
        i: 3
        i: 3
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_1/combine/add"
  op: "Add"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_1/left/MaxPool2D/MaxPool"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_1/right/bn_sep_7x7_2/FusedBatchNorm"
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/left/Relu"
  op: "Relu"
  input: "FirstStageFeatureExtractor/cell_stem_0/split"
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/left/separable_5x5_1/separable_conv2d/depthwise"
  op: "DepthwiseConv2dNative"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/left/Relu"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/left/separable_5x5_1/depthwise_weights/read/_148__cf__154"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/left/separable_5x5_1/separable_conv2d"
  op: "Conv2D"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/left/separable_5x5_1/separable_conv2d/depthwise"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/left/separable_5x5_1/pointwise_weights/read/_147__cf__153"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/left/bn_sep_5x5_1/FusedBatchNorm"
  op: "BiasAdd"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/left/separable_5x5_1/separable_conv2d"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/left/separable_5x5_1/separable_conv2d_bn_offset"
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/left/Relu_1"
  op: "Relu"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/left/bn_sep_5x5_1/FusedBatchNorm"
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/left/separable_5x5_2/separable_conv2d/depthwise"
  op: "DepthwiseConv2dNative"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/left/Relu_1"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/left/separable_5x5_2/depthwise_weights/read/_142__cf__148"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/left/separable_5x5_2/separable_conv2d"
  op: "Conv2D"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/left/separable_5x5_2/separable_conv2d/depthwise"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/left/separable_5x5_2/pointwise_weights/read/_141__cf__147"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/left/bn_sep_5x5_2/FusedBatchNorm"
  op: "BiasAdd"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/left/separable_5x5_2/separable_conv2d"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/left/separable_5x5_2/separable_conv2d_bn_offset"
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/combine/add"
  op: "Add"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/left/bn_sep_5x5_2/FusedBatchNorm"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/right/bn_sep_7x7_2/FusedBatchNorm"
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_4/left/Relu"
  op: "Relu"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/combine/add"
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_4/left/separable_3x3_1/separable_conv2d/depthwise"
  op: "DepthwiseConv2dNative"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_4/left/Relu"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_4/left/separable_3x3_1/depthwise_weights/read/_124__cf__130"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_4/left/separable_3x3_1/separable_conv2d"
  op: "Conv2D"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_4/left/separable_3x3_1/separable_conv2d/depthwise"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_4/left/separable_3x3_1/pointwise_weights/read/_123__cf__129"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_4/left/bn_sep_3x3_1/FusedBatchNorm"
  op: "BiasAdd"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_4/left/separable_3x3_1/separable_conv2d"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_4/left/separable_3x3_1/separable_conv2d_bn_offset"
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_4/left/Relu_1"
  op: "Relu"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_4/left/bn_sep_3x3_1/FusedBatchNorm"
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_4/left/separable_3x3_2/separable_conv2d/depthwise"
  op: "DepthwiseConv2dNative"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_4/left/Relu_1"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_4/left/separable_3x3_2/depthwise_weights/read/_118__cf__124"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_4/left/separable_3x3_2/separable_conv2d"
  op: "Conv2D"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_4/left/separable_3x3_2/separable_conv2d/depthwise"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_4/left/separable_3x3_2/pointwise_weights/read/_117__cf__123"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_4/left/bn_sep_3x3_2/FusedBatchNorm"
  op: "BiasAdd"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_4/left/separable_3x3_2/separable_conv2d"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_4/left/separable_3x3_2/separable_conv2d_bn_offset"
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_4/combine/add"
  op: "Add"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_4/left/bn_sep_3x3_2/FusedBatchNorm"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_4/right/MaxPool2D/MaxPool"
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_3/right/AvgPool2D/AvgPool"
  op: "AvgPool"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_0/combine/add"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "ksize"
    value {
      list {
        i: 1
        i: 3
        i: 3
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_3/combine/add"
  op: "Add"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_1/combine/add"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_3/right/AvgPool2D/AvgPool"
}
node {
  name: "FirstStageFeatureExtractor/cell_stem_0/cell_output/concat"
  op: "ConcatV2"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_1/combine/add"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_2/combine/add"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_3/combine/add"
  input: "FirstStageFeatureExtractor/cell_stem_0/comb_iter_4/combine/add"
  input: "FirstStageFeatureExtractor/cell_stem_0/cell_output/concat/axis"
}
node {
  name: "FirstStageFeatureExtractor/cell_0/Relu"
  op: "Relu"
  input: "FirstStageFeatureExtractor/cell_stem_0/cell_output/concat"
}
node {
  name: "FirstStageFeatureExtractor/cell_0/Pad"
  op: "Pad"
  input: "FirstStageFeatureExtractor/cell_0/Relu"
  input: "FirstStageFeatureExtractor/cell_0/Pad/paddings"
}
node {
  name: "FirstStageFeatureExtractor/cell_0/strided_slice"
  op: "StridedSlice"
  input: "FirstStageFeatureExtractor/cell_0/Pad"
  input: "FirstStageFeatureExtractor/cell_0/strided_slice/stack"
  input: "FirstStageFeatureExtractor/cell_0/strided_slice/stack_1"
  input: "FirstStageFeatureExtractor/cell_0/strided_slice/stack_2"
  attr {
    key: "begin_mask"
    value {
      i: 9
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 15
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "FirstStageFeatureExtractor/cell_0/AvgPool_1"
  op: "AvgPool"
  input: "FirstStageFeatureExtractor/cell_0/strided_slice"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "ksize"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "FirstStageFeatureExtractor/cell_0/path2_conv/Conv2D"
  op: "Conv2D"
  input: "FirstStageFeatureExtractor/cell_0/AvgPool_1"
  input: "FirstStageFeatureExtractor/cell_0/path2_conv/weights/read/_255__cf__261"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FirstStageFeatureExtractor/cell_0/concat_bn_in1"
  op: "BiasAdd"
  input: "FirstStageFeatureExtractor/cell_0/path2_conv/Conv2D"
  input: "FirstStageFeatureExtractor/cell_0/path2_conv/Conv2D_bn_offset"
}
node {
  name: "FirstStageFeatureExtractor/cell_0/AvgPool"
  op: "AvgPool"
  input: "FirstStageFeatureExtractor/cell_0/Relu"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "ksize"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "FirstStageFeatureExtractor/cell_0/path1_conv/Conv2D"
  op: "Conv2D"
  input: "FirstStageFeatureExtractor/cell_0/AvgPool"
  input: "FirstStageFeatureExtractor/cell_0/path1_conv/weights/read/_256__cf__262"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FirstStageFeatureExtractor/cell_0/concat_bn_in0"
  op: "BiasAdd"
  input: "FirstStageFeatureExtractor/cell_0/path1_conv/Conv2D"
  input: "FirstStageFeatureExtractor/cell_0/path1_conv/Conv2D_bn_offset"
}
node {
  name: "FirstStageFeatureExtractor/cell_0/final_path_bn/FusedBatchNorm"
  op: "ConcatV2"
  input: "FirstStageFeatureExtractor/cell_0/concat_bn_in0"
  input: "FirstStageFeatureExtractor/cell_0/concat_bn_in1"
  input: "FirstStageFeatureExtractor/cell_0/concat/axis"
}
node {
  name: "FirstStageFeatureExtractor/cell_0/comb_iter_3/right/AvgPool2D/AvgPool"
  op: "AvgPool"
  input: "FirstStageFeatureExtractor/cell_0/final_path_bn/FusedBatchNorm"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "ksize"
    value {
      list {
        i: 1
        i: 3
        i: 3
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FirstStageFeatureExtractor/cell_0/comb_iter_3/left/AvgPool2D/AvgPool"
  op: "AvgPool"
  input: "FirstStageFeatureExtractor/cell_0/final_path_bn/FusedBatchNorm"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "ksize"
    value {
      list {
        i: 1
        i: 3
        i: 3
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FirstStageFeatureExtractor/cell_0/comb_iter_3/combine/add"
  op: "Add"
  input: "FirstStageFeatureExtractor/cell_0/comb_iter_3/left/AvgPool2D/AvgPool"
  input: "FirstStageFeatureExtractor/cell_0/comb_iter_3/right/AvgPool2D/AvgPool"
}
node {
  name: "FirstStageFeatureExtractor/cell_0/comb_iter_1/right/Relu"
  op: "Relu"
  input: "FirstStageFeatureExtractor/cell_0/final_path_bn/FusedBatchNorm"
}
node {
  name: "FirstStageFeatureExtractor/cell_0/comb_iter_1/right/separable_3x3_1/separable_conv2d/depthwise"
  op: "DepthwiseConv2dNative"
  input: "FirstStageFeatureExtractor/cell_0/comb_iter_1/right/Relu"
  input: "FirstStageFeatureExtractor/cell_0/comb_iter_1/right/separable_3x3_1/depthwise_weights/read/_268__cf__274"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FirstStageFeatureExtractor/cell_0/comb_iter_1/right/separable_3x3_1/separable_conv2d"
  op: "Conv2D"
  input: "FirstStageFeatureExtractor/cell_0/comb_iter_1/right/separable_3x3_1/separable_conv2d/depthwise"
  input: "FirstStageFeatureExtractor/cell_0/comb_iter_1/right/separable_3x3_1/pointwise_weights/read/_267__cf__273"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FirstStageFeatureExtractor/cell_0/comb_iter_1/right/bn_sep_3x3_1/FusedBatchNorm"
  op: "BiasAdd"
  input: "FirstStageFeatureExtractor/cell_0/comb_iter_1/right/separable_3x3_1/separable_conv2d"
  input: "FirstStageFeatureExtractor/cell_0/comb_iter_1/right/separable_3x3_1/separable_conv2d_bn_offset"
}
node {
  name: "FirstStageFeatureExtractor/cell_0/comb_iter_1/right/Relu_1"
  op: "Relu"
  input: "FirstStageFeatureExtractor/cell_0/comb_iter_1/right/bn_sep_3x3_1/FusedBatchNorm"
}
node {
  name: "FirstStageFeatureExtractor/cell_0/comb_iter_1/right/separable_3x3_2/separable_conv2d/depthwise"
  op: "DepthwiseConv2dNative"
  input: "FirstStageFeatureExtractor/cell_0/comb_iter_1/right/Relu_1"
